AUTO_config_TK_pesok/src/InformationRegisters/СрокиВозвратаТовара/СрокиВозвратаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СрокиВозвратаТовара</name>
  <resources>
    <name>СрокПодачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/СрокиВозвратаТовара/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем

#КонецОбласти



Функция ПолучитьСрокиВозврата(Подразделение,Номенклатура)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиВозвратаТовара.СрокПодачи + СрокиВозвратаТовара.СрокВозврата КАК резСрок
		|ИЗ
		|	РегистрСведений.СрокиВозвратаТовара КАК СрокиВозвратаТовара
		|ГДЕ
		|	СрокиВозвратаТовара.Подразделение = &Подразделение
		|	И СрокиВозвратаТовара.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.резСрок;

КонецФункции


#КонецОбласти



#КонецЕсли
